source/_static/diagrams/reframe-reader.d2
direction: right
setup
compile
run
sanity
perf: performance
clean: cleanup
setup -> compile -> run -> sanity -> perf -> clean
